# NumPanels Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
CurtainGrid..::..NumPanels Property
CurtainGrid Class See Also
---
The number of panels.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public int NumPanels { get; }
```

Visual Basic
---
```text
Public ReadOnly Property NumPanels As Integer
	Get
```

Visual C++
---
```text
public:
property int NumPanels {
	int get ();
}
```

# See Also
CurtainGrid Class
Autodesk.Revit.DB Namespace